In [1]:
import urllib.request
import zipfile
import os
import ssl

try:
    os.mkdir("files")
except:
    pass

ssl._create_default_https_context = ssl._create_unverified_context

with urllib.request.urlopen('https://courses.cs.tau.ac.il/pyProg/2425a/resources/notebook_resources.zip') as f:
    content = f.read()

with open('files/notebook_resources.zip', 'wb') as f:
    f.write(content)

with zipfile.ZipFile('files/notebook_resources.zip', 'r') as zip_ref:
    zip_ref.extractall('files')

print(os.listdir('files'))

import pandas as pd
pd.options.display.max_rows=5

['monday.txt', 'orders_2_2024.csv', 'orders_4_2024.csv', 'dialation_2.png', 'infile1.txt', 'out.txt', 'evil_morty_segmentation.png', 'evil_morty_change_3.png', 'erosion_2.png', 'ex2.csv', 'dog_noised.png', 'dog.png', '__MACOSX', 'ship.png', 'evil_morty_change.png', 'products2.csv', 'countries-of-the-world.csv', 'foods.txt', 'sunday.txt', 'infile2.txt', 'evil_morty_change_noised.png', 'erosion.png', 'evil_morty_1.png', 'StudentsGrades.csv', 'witcher_2.csv', 'ex1.csv', 'witcher_1.csv', 'dialation.png', 'orders_3_2024.csv', 'woman_noised.png', 'baby.png', 'notebook_resources.zip', 'koala.png']

# עריכת טבלאות מתקדמת

### מיסוך (Masking) בPandas

In [2]:
```{admonition} **שימו לב**
:class: warning

במקרה זה אין צורך לפרט `ignore_index=True` מכיוון שאנו מוסיפים עמודה, ואנו מניחים שאין עמודה בעלת שם זהה בטבלה.

```

SyntaxError: invalid syntax (4001686813.py, line 1)

הפעולות להלן יודגמו טבלת הציונים `"files/StudentsGrades.csv"`:

In [128]:
inputFileName = "files/StudentsGrades.csv"
df = pd.read_csv(inputFileName)
display(df)

,Name,Programming,Marine Biology,Stellar Cartography,Math,History,Planet Survival,Art
0,Yael,50,56,70,60,87,65,91
1,Nadav,61,77,75,75,63,52,88
...,...,...,...,...,...,...,...,...
11,Tom,98,76,98,100,98,92,80
12,Adi,76,87,34,90,88,84,70

Mask (מסכה) היא **טבלה או סדרה בוליאנית** המסמנת אילו **תאים** ב**טבלה (או סדרה) אחרת** רלוונטיים לשימוש ואילו תאים צריכים להישאר מוסתרים או מחוץ לחישוב. אפשר לדמיין מערך זה כמו מסננת או שכבה אטומה עם חורים : החורים חושפים חלק מהמידע, בעוד שאר האזורים מכוסים. לדוגמא, עבור הטבלה שלנו `df` ניתן לייצר מסיכה מאחת העמודות  (לדוגמא, `m=df["Art"]>90`)' ולבצע מיסוך `df[m]` או `df.loc[m]`. משמעות מיסוך זה הוא ששורות בהם קיים הערך `True` להכלל בחישוב וערכי `False` תואמים לשורות שיש להתעלם מהם.

ביצוע הMasking יכול לשמש אותנו כדי להחזיר תת-טבלה , או כדי לבצע פעולה על תת-טבלה.

נבחן למטה כמה דוגמאות:

נניח כי נרצה להסיר את כל הסטודנטיות ששמן יעל.

תחילה ניצור מסיכה:

In [134]:
msk=df['Name'] != 'Yael'
display(msk)

0     False
1      True
      ...
11     True
12     True
Name: Name, Length: 13, dtype: bool

ולאחר מכן נסנן את הטבלה:

In [133]:
display(df[msk])

,Name,Programming,Marine Biology,Stellar Cartography,Math,History,Planet Survival,Art
0,Yael,50,56,70,60,87,65,91
2,Michal,81,72,76,94,67,81,78
...,...,...,...,...,...,...,...,...
11,Tom,98,76,98,100,98,92,80
12,Adi,76,87,34,90,88,84,70

ניתן גם **להשאיר** רק סטודנטיות ששמן יעל באמצעות יצירת מסיכה של התנאי ההפוך. 

נראה כיצד לעשות זאת בשורה אחת בלבד:

In [136]:
df[df['Name'] == 'Yael']

,Name,Programming,Marine Biology,Stellar Cartography,Math,History,Planet Survival,Art
0,Yael,50,56,70,60,87,65,91

בדומה לאופרטורים אריתמטיים, ניתן להפעיל פעולות `and`, `or` ו-`not` עבור סדרות וטבלאות בוליאניות (או במילים אחרות, עבור מסיכות).  
אך בשונה מערכים בוליאניים רגילים, כאן לאופרטורים אלו יש סימון אחר:
- `and` --> `&`
- `or` --> `|`
- `not` --> `~`

נדגים זאת באמצעות החזרת כל הסטודנטים שקיבלו מעל 70 מתמטיקה ומעל 90 באומנות:

In [148]:
display(df[(df['Math'] > 70) & (df['Art'] > 90)])

,Name,Programming,Marine Biology,Stellar Cartography,Math,History,Planet Survival,Art
6,Yarden,63,62,70,74,92,98,94
7,Avi,78,64,54,88,97,76,100

```{admonition} **שימו לב**
:class: warning
בPandas האופרטורים הלוגיים `&` `|` `~` קודמים להשוואתיים (כמו `<` `>` `==`). לכן חשוב לעטוף כל מסיכה בסוגריים על מנת למנוע מהאופרטור הלוגי לפעול לפני האופרטור ההשוואתי.
```

באמצעות Masking ניתן גם לבצע השמה מותנית, כלומר, לבצע השמה רק במקומות בהם יש במסיכה `True`

לדוגמא, בשורה הבאה "נעביר" את כל הסטודנטים שנכשלו בתכנות, וניתן להם את הציון 60 (אתם יכולים לראות שהציון של יעל התחלף מ50 ל60).

In [149]:
df.loc[df["Programming"] < 60, "Programming"] = 60
display(df)

,Name,Programming,Marine Biology,Stellar Cartography,Math,History,Planet Survival,Art
0,Yael,60,56,70,60,87,65,91
1,Nadav,61,77,75,75,63,52,88
...,...,...,...,...,...,...,...,...
11,Tom,98,76,98,100,98,92,80
12,Adi,76,87,34,90,88,84,70

### מתודת `apply`

המתודה `apply` מאפשרת להפעיל פונקציה על עמודה או על כל שורה ב-DataFrame. במקום להשתמש בלולאות, `apply` מאפשרת לנו לבצע חישוב או שינוי על כל השורות או העמודות של הטבלה בבת אחת.    
עבור סדרה, `apply` תבצע את הפעולה על כל ערכים בסדרה בבת אחת.   

לדוגמא, אם נרצה להעלות את כל הציונים בעמודה `Art` ב10, אבל לוודא שלא יהיו ציונים גבוהים מ10, נוכל לעשות זאת באופן הבא:

`df["Art"]=df["Art"].apply(lambda a: min(100, a+10)`

In [153]:
df.iloc[:,1:].apply(lambda a: min(100, a+10))

0      70
1      71
     ...
11    100
12     86
Name: Programming, Length: 13, dtype: int64

בדומה לחישוב ממוצע המקצועות שראינו קודם, גם ל`apply`, יש פרמטר בשם `axis`:
בברירת מחדל, `apply` מופעל עם הקלט `axis=0`. כלומר, מתבצעת פעולה **בין השורות השונות**, או במילים אחרות - **על כל עמודה בנפרד**.
ולהיפך, הפעלת `apply` עם `axis=1`. יבצע פעולה **בין העמודות השונות**, או במילים אחרות - **על כל שורה בנפרד**.



נדגים זאת באמצעות ממוצע באמצעות `apply`: 
`df.iloc[:,1:].apply(lambda a: a.mean(), axis=1)

שימו לב ש`apply` מחלץ ממוצע עבור כל סטודנט בנפרד (כלומר, עבור כל שורה), והתוצאה היא **סדרה במבנה על עמודה בטבלה**, בה קיים ממוצע כל סטודנט.

מה היה קורה אם היינו מפעילים את אותה השורה עם `axis=0`?

היינו מחלצים ממוצע עבור כל **מקצוע** בנפרד (כלומר, עבור כל טור) מה שהיה מסתכם לכדי שורה חדשה (ללא עמודת שם הסטודנט, אותה חתכנו באמצעות `iloc`) 

נחזור למשימת הוספת פקטור של 10 נקודות. מה אם במקום להוסיף זאת רק עבוא אומנות, היינו מוסיפים זאת **לכלל המקצועות**?   
היינו חושבים אולי לבצע משהו כזה:

`(df.iloc[:,1:]=df.iloc[:,1:].apply(lambda a: min(100, a+10)`

אבל מכיוון שאנו פועלים כעת על טבלה (ולא על סדרה כמו בדוגמא הראשונה), איננו יכולים להפעיל כך את `min`.

לכן, נשנה את המימוש באופן הבא:

`(df.iloc[:,1:]=df.iloc[:,1:].apply(lambda a: (a+10).clip(upper=100)`

המתודה `clip` של Pandas משתמש כדי לקטום את הערכים שלנו. במקרה שלנו, היינו צריכים רק להגביל את הערכים למעלה, ולכן השתמש רק בפרמטר `upper=100`.

In [160]:
df.iloc[:,1:].apply(lambda a: a+10).clip(upper=100)

,Programming,Marine Biology,Stellar Cartography,Math,History,Planet Survival,Art
0,70,66,80,70,97,75,100
1,71,87,85,85,73,62,98
...,...,...,...,...,...,...,...
11,100,86,100,100,100,100,90
12,86,97,44,100,98,94,80


```{admonition} **שימו לב**
:class: warning


במקרה הזה, אין חשיבות לפרמטר `axis` ב`apply` מכיוון שהפעולה נעשית בסופו של דבר על כל ערך בנפרד, והם אינם "נסכמים" ביחד.

```

#### תרגיל

בשורה אחת בלבד, שנו אמצעות המתודה apply את שמות הסטודנטים כך שכולם יהיו באותיות גדולות

In [ ]:
# Write your code here
display(df)